RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_cau.c
        /* set the key parameters with the default values */
        cau_context->key_0_high    = 0U;
        cau_context->key_0_low     = 0U;
        cau_context->key_1_high    = 0U;
        cau_context->key_1_low     = 0U;
        cau_context->key_2_high    = 0U;
        cau_context->key_2_low     = 0U;
        cau_context->key_3_high    = 0U;
        cau_context->key_3_low     = 0U;

        /* set the context switch with the default values */
        cau_context->gcmccmctxs[0] = 0U;
        cau_context->gcmccmctxs[1] = 0U;
        cau_context->gcmccmctxs[2] = 0U;
        cau_context->gcmccmctxs[3] = 0U;
        cau_context->gcmccmctxs[4] = 0U;
        cau_context->gcmccmctxs[5] = 0U;
        cau_context->gcmccmctxs[6] = 0U;
        cau_context->gcmccmctxs[7] = 0U;

        cau_context->gcmctxs[0]    = 0U;
        cau_context->gcmctxs[1]    = 0U;
        cau_context->gcmctxs[2]    = 0U;
        cau_context->gcmctxs[3]    = 0U;
        cau_context->gcmctxs[4]    = 0U;
        cau_context->gcmctxs[5]    = 0U;
        cau_context->gcmctxs[6]    = 0U;
        cau_context->gcmctxs[7]    = 0U;

        cau_context->cmacctxs[0U]  = 0U;
        cau_context->cmacctxs[1U]  = 0U;
        cau_context->cmacctxs[2U]  = 0U;
        cau_context->cmacctxs[3U]  = 0U;
    }
}

/*!
    \brief      enable the CAU peripheral (API_ID(0x0006U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void cau_enable(void)
{
    /* enable the CAU processor */
    CAU_CTL |= CAU_CTL_CAUEN;
}

/*!
    \brief      disable the CAU peripheral (API_ID(0x0007U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void cau_disable(void)
{
    /* disable the CAU processor */
    CAU_CTL &= ~CAU_CTL_CAUEN;
}

/*!
    \brief      enable the CAU DMA interface (API_ID(0x0008U))
    \param[in]  dma_req: specify the CAU DMA transfer request to be enabled
                one or more parameters can be selected which are shown as below:
      \arg        CAU_DMA_INFIFO: DMA for incoming(Rx) data transfer
      \arg        CAU_DMA_OUTFIFO: DMA for outgoing(Tx) data transfer
    \param[out] none
    \retval     none
*/
void cau_dma_enable(uint32_t dma_req)
{
    /* enable the selected CAU DMA request */
    CAU_DMAEN |= (dma_req & CAU_DMAEN_MASK);
}

/*!
    \brief      disable the CAU DMA interface (API_ID(0x0009U))
    \param[in]  dma_req: specify the CAU DMA transfer request to be disabled
                one or more parameters can be selected which are shown as below:
      \arg        CAU_DMA_INFIFO: DMA for incoming(Rx) data transfer
      \arg        CAU_DMA_OUTFIFO: DMA for outgoing(Tx) data transfer
    \param[out] none
    \retval     none
*/
void cau_dma_disable(uint32_t dma_req)
{
    /* disable the selected CAU DMA request */
    CAU_DMAEN &= ~(dma_req & CAU_DMAEN_MASK);
}

/*!
    \brief      initialize the CAU peripheral (API_ID(0x000AU))
    \param[in]  alg_dir: algorithm direction
                only one parameter can be selected which is shown as below:
      \arg        CAU_ENCRYPT: encrypt
      \arg        CAU_DECRYPT: decrypt
    \param[in]  alg_mode: algorithm mode selection
                only one parameter can be selected which is shown as below:
      \arg        CAU_MODE_AES_ECB:  AES-ECB (AES Electronic codebook)
      \arg        CAU_MODE_AES_CBC:  AES-CBC (AES Cipher block chaining)
      \arg        CAU_MODE_AES_CTR:  AES-CTR (AES counter mode)
      \arg        CAU_MODE_AES_KEY:  AES decryption key preparation mode
      \arg        CAU_MODE_AES_GCM:  AES-GCM (AES Galois/counter mode)
      \arg        CAU_MODE_AES_CCM:  AES-CCM (AES combined cipher machine mode)
      \arg        CAU_MODE_AES_CFB:  AES-CFB (cipher feedback mode)
      \arg        CAU_MODE_AES_OFB:  AES-OFB (output feedback mode)
      \arg        CAU_MODE_AES_CMAC: AES-CMAC (AES cmac mode)
    \param[in]  swapping: data swapping selection
                only one parameter can be selected which is shown as below:
      \arg        CAU_SWAPPING_32BIT: no swapping
      \arg        CAU_SWAPPING_16BIT: half-word swapping
      \arg        CAU_SWAPPING_8BIT:  bytes swapping
      \arg        CAU_SWAPPING_1BIT:  bit swapping
    \param[in]  key_sel:  select key from efuse or registers
                only one parameter can be selected which is shown as below:
      \arg        CAU_REG_KEY: key from registers
      \arg        CAU_OTP_KEY: key from OTP
    \param[out] none
    \retval     none
*/
void cau_init(uint32_t alg_dir, uint32_t alg_mode, uint32_t swapping, uint32_t key_sel)
{
    /* select algorithm mode */
    CAU_CTL &= ~CAU_CTL_ALGM;
    CAU_CTL |= (alg_mode & CAU_CTL_ALGM);

    /* select data swapping */
    CAU_CTL &= ~CAU_CTL_DATAM;
    CAU_CTL |= (swapping & CAU_CTL_DATAM);

    /* select algorithm direction */
    CAU_CTL &= ~CAU_CTL_CAUDIR;
    CAU_CTL |= (alg_dir & CAU_CTL_CAUDIR);

    /* select key */
    CAU_CTL &= ~CAU_CTL_KEYSEL;
    CAU_CTL |= (key_sel & CAU_CTL_KEYSEL);
}

/*!
    \brief      configure key size if use AES algorithm (API_ID(0x000BU))
    \param[in]  key_size: key length selection when aes mode
                only one parameter can be selected which is shown as below:
      \arg        CAU_KEYSIZE_128BIT: 128 bit key length
      \arg        CAU_KEYSIZE_192BIT: 192 bit key length
      \arg        CAU_KEYSIZE_256BIT: 256 bit key length
    \param[out] none
    \retval     none
*/
void cau_aes_keysize_config(uint32_t key_size)
{
    CAU_CTL &= ~CAU_CTL_KEYM;
    CAU_CTL |= (key_size & CAU_CTL_KEYM);
}

/*!
    \brief      initialize the key parameters (API_ID(0x000CU))
    \param[in]  key_initpara: key init parameter struct
                  key_0_high: key 0 high
                  key_0_low:  key 0 low
                  key_1_high: key 1 high
                  key_1_low:  key 1 low
                  key_2_high: key 2 high
                  key_2_low:  key 2 low
                  key_3_high: key 3 high
                  key_3_low:  key 3 low
    \param[out] none
    \retval     none
*/
void cau_key_init(cau_key_parameter_struct *key_initpara)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(key_initpara)) {
        fw_debug_report_err(CAU_MODULE_ID, API_ID(0x000CU), ERR_PARAM_POINTER);
    } else
#endif
    {
        CAU_KEY0H = key_initpara->key_0_high;
        CAU_KEY0L = key_initpara->key_0_low;
        CAU_KEY1H = key_initpara->key_1_high;
        CAU_KEY1L = key_initpara->key_1_low;
        CAU_KEY2H = key_initpara->key_2_high;
        CAU_KEY2L = key_initpara->key_2_low;
        CAU_KEY3H = key_initpara->key_3_high;
        CAU_KEY3L = key_initpara->key_3_low;
    }
}

/*!
    \brief      initialize the vectors parameters (API_ID(0x000DU))
    \param[in]  iv_initpara: vectors init parameter struct
                  iv_0_high: init vector 0 high
                  iv_0_low:  init vector 0 low
                  iv_1_high: init vector 1 high
                  iv_1_low:  init vector 1 low
    \retval     none
*/
void cau_iv_init(cau_iv_parameter_struct *iv_initpara)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(iv_initpara)) {
        fw_debug_report_err(CAU_MODULE_ID, API_ID(0x000DU), ERR_PARAM_POINTER);
    } else
#endif
    {
        CAU_IV0H = iv_initpara->iv_0_high;
        CAU_IV0L = iv_initpara->iv_0_low;
        CAU_IV1H = iv_initpara->iv_1_high;
        CAU_IV1L = iv_initpara->iv_1_low;
    }
}

/*!
    \brief      configure phase (API_ID(0x000EU))
    \param[in]  phase: gcm or ccm phase
                only one parameter can be selected which is shown as below:
      \arg        CAU_PREPARE_PHASE: prepare phase
      \arg        CAU_AAD_PHASE: AAD phase
      \arg        CAU_ENCRYPT_DECRYPT_PHASE: encryption/decryption phase
      \arg        CAU_TAG_PHASE: tag phase
    \param[out] none
    \retval     none
*/
void cau_phase_config(uint32_t phase)
{
    /* Reset the phase configuration bits */
    CAU_CTL &= ~CAU_CTL_GCM_CCMPH;
    /* Set the selected phase */
    CAU_CTL |= (phase & CAU_CTL_GCM_CCMPH);
}

/*!
    \brief      flush the IN and OUT FIFOs (API_ID(0x000FU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void cau_fifo_flush(void)
{
    /* reset the read and write pointers of the FIFOs */
    CAU_CTL |= CAU_CTL_FFLUSH;
}

/*!
    \brief      return whether CAU peripheral is enabled or disabled (API_ID(0x0010U))
    \param[in]  none
    \param[out] none
    \retval     ControlStatus: ENABLE or DISABLE
*/
ControlStatus cau_enable_state_get(void)
{
    ControlStatus ret = DISABLE;
    if(RESET != (CAU_CTL & CAU_CTL_CAUEN)) {
        ret = ENABLE;
    }
    return ret;
}

/*!
    \brief      write data to the IN FIFO (API_ID(0x0011U))
    \param[in]  data: data to write (0 - 0xFFFFFFFF)
    \param[out] none
    \retval     none
*/
void cau_data_write(uint32_t data)
{
    CAU_DI = data;
}

/*!
    \brief      return the last data entered into the output FIFO (API_ID(0x0012U))
    \param[in]  none
    \param[out] none
    \retval     last data entered into the output FIFO
*/
uint32_t cau_data_read(void)
{
    return CAU_DO;
}

/*!
    \brief      save context before context switching (API_ID(0x0013U))
    \param[in]  key_initpara: key init parameter struct
                  key_0_high: key 0 high
                  key_0_low:  key 0 low
                  key_1_high: key 1 high
                  key_1_low:  key 1 low
                  key_2_high: key 2 high
                  key_2_low:  key 2 low
                  key_3_high: key 3 high
                  key_3_low:  key 3 low
    \param[out] cau_context:
                  ctl_config: current configuration
                  iv_0_high: init vector 0 high
                  iv_0_low:  init vector 0 low
                  iv_1_high: init vector 1 high
                  iv_1_low:  init vector 1 low
                  key_0_high: key 0 high
                  key_0_low:  key 0 low
                  key_1_high: key 1 high
                  key_1_low:  key 1 low
                  key_2_high: key 2 high
                  key_2_low:  key 2 low
                  key_3_high: key 3 high
                  key_3_low:  key 3 low
                  gcmccmctxs[8]: GCM or CCM mode context switch
                  gcmctxs[8]: GCM mode context switch
                  cmacctxs[4]: CMAC mode context switch
    \retval     none
    \note       This function contains scenarios leading to an infinite loop.
                Modify according to the user's actual usage scenarios.
*/
void cau_context_save(cau_context_parameter_struct *cau_context, cau_key_parameter_struct *key_initpara)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(cau_context) || NOT_VALID_POINTER(key_initpara)) {
        fw_debug_report_err(CAU_MODULE_ID, API_ID(0x0013U), ERR_PARAM_POINTER);
    } else
#endif
    {
        uint32_t algm_reg = 0U;

        /* stop DMA transfers on the IN FIFO by clearing the DMAIEN bit in the CAU_DMAEN */
        CAU_DMAEN &= ~CAU_DMA_INFIFO;

