RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_cau.c
        /* get CAU algorithm */
        algm_reg = CAU_CTL & CAU_CTL_ALGM;

        /* wait until both the IN and OUT FIFOs are empty (IEM=1 and ONE=0 in the CAU_STAT0 register) and BUSY=0 */
        while((CAU_STAT0 & STAT0_AES_MASK) != CAU_STAT0_IEM) {
        }

        /* stop DMA transfers on the OUT FIFO by clear CAU_DMAEN_DMAOEN=0 */
        CAU_DMAEN &= ~CAU_DMAEN_DMAOEN;
        /* disable CAU */
        CAU_CTL &= ~CAU_CTL_CAUEN;

        /* save the current configuration (bit 19, bit[17:16], bit[9:2] and bit[0] in the CAU_CTL register) */
        cau_context->ctl_config  = CAU_CTL & (CAU_CTL_GCM_CCMPH |
                                              CAU_CTL_KEYM  |
                                              CAU_CTL_DATAM |
                                              CAU_CTL_ALGM  |
                                              CAU_CTL_CAUDIR |
                                              CAU_CTL_NBPILB |
                                              CAU_CTL_KEYSEL);

        /* save the key value */
        if(0U == ((cau_context->ctl_config) & CAU_CTL_KEYSEL)) {
            cau_context->key_0_high = key_initpara->key_0_high;
            cau_context->key_0_low  = key_initpara->key_0_low;
            cau_context->key_1_high = key_initpara->key_1_high;
            cau_context->key_1_low  = key_initpara->key_1_low;
            cau_context->key_2_high = key_initpara->key_2_high;
            cau_context->key_2_low  = key_initpara->key_2_low;
            cau_context->key_3_high = key_initpara->key_3_high;
            cau_context->key_3_low  = key_initpara->key_3_low;
        }

        /* if not in ECB mode, save the initialization vectors */
        if(CAU_MODE_AES_ECB != algm_reg) {
            cau_context->iv_0_high = CAU_IV0H;
            cau_context->iv_0_low  = CAU_IV0L;
            cau_context->iv_1_high = CAU_IV1H;
            cau_context->iv_1_low  = CAU_IV1L;
        }

        /* if in GCM/CCM mode, save the context switch registers */
        if((CAU_MODE_AES_GCM == algm_reg) || (CAU_MODE_AES_CCM == algm_reg)) {
            cau_context->gcmccmctxs[0U] = CAU_GCMCCMCTXSx(0U);
            cau_context->gcmccmctxs[1U] = CAU_GCMCCMCTXSx(1U);
            cau_context->gcmccmctxs[2U] = CAU_GCMCCMCTXSx(2U);
            cau_context->gcmccmctxs[3U] = CAU_GCMCCMCTXSx(3U);
            cau_context->gcmccmctxs[4U] = CAU_GCMCCMCTXSx(4U);
            cau_context->gcmccmctxs[5U] = CAU_GCMCCMCTXSx(5U);
            cau_context->gcmccmctxs[6U] = CAU_GCMCCMCTXSx(6U);
            cau_context->gcmccmctxs[7U] = CAU_GCMCCMCTXSx(7U);
        }

        /* if in GCM mode, save the context switch registers */
        if(CAU_MODE_AES_GCM == algm_reg) {
            cau_context->gcmctxs[0U] = CAU_GCMCTXSx(0U);
            cau_context->gcmctxs[1U] = CAU_GCMCTXSx(1U);
            cau_context->gcmctxs[2U] = CAU_GCMCTXSx(2U);
            cau_context->gcmctxs[3U] = CAU_GCMCTXSx(3U);
            cau_context->gcmctxs[4U] = CAU_GCMCTXSx(4U);
            cau_context->gcmctxs[5U] = CAU_GCMCTXSx(5U);
            cau_context->gcmctxs[6U] = CAU_GCMCTXSx(6U);
            cau_context->gcmctxs[7U] = CAU_GCMCTXSx(7U);
        }

        /* if in CMAC mode, save the context switch registers */
        if(CAU_MODE_AES_CMAC == algm_reg) {
            cau_context->cmacctxs[0U] = CAU_CMACCTXx(0U);
            cau_context->cmacctxs[1U] = CAU_CMACCTXx(1U);
            cau_context->cmacctxs[2U] = CAU_CMACCTXx(2U);
            cau_context->cmacctxs[3U] = CAU_CMACCTXx(3U);
        }
    }
}

/*!
    \brief      restore context after context switching (API_ID(0x0014U))
    \param[in]  cau_context:
                  ctl_config: current configuration
                  iv_0_high: init vector 0 high
                  iv_0_low:  init vector 0 low
                  iv_1_high: init vector 1 high
                  iv_1_low:  init vector 1 low
                  key_0_high: key 0 high
                  key_0_low:  key 0 low
                  key_1_high: key 1 high
                  key_1_low:  key 1 low
                  key_2_high: key 2 high
                  key_2_low:  key 2 low
                  key_3_high: key 3 high
                  key_3_low:  key 3 low
                  gcmccmctxs[8]: GCM or CCM mode context switch
                  gcmctxs[8]: GCM mode context switch
                  cmacctxs[4]: CMAC mode context switch
    \param[out] none
    \retval     none
    \note       This function contains scenarios leading to an infinite loop.
                Modify according to the user's actual usage scenarios.
*/
void cau_context_restore(cau_context_parameter_struct *cau_context)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(cau_context)) {
        fw_debug_report_err(CAU_MODULE_ID, API_ID(0x0014U), ERR_PARAM_POINTER);
    } else
#endif
    {
        uint32_t algm_reg, aes_decrypt;

        /* configure the processor with the saved configuration */
        CAU_CTL = cau_context->ctl_config;

        algm_reg = CAU_CTL & CAU_CTL_ALGM;

        /* restore the key value */
        if(0U == ((cau_context->ctl_config) & CAU_CTL_KEYSEL)) {
            CAU_KEY0H = cau_context->key_0_high;
            CAU_KEY0L = cau_context->key_0_low;
            CAU_KEY1H = cau_context->key_1_high;
            CAU_KEY1L = cau_context->key_1_low;
            CAU_KEY2H = cau_context->key_2_high;
            CAU_KEY2L = cau_context->key_2_low;
            CAU_KEY3H = cau_context->key_3_high;
            CAU_KEY3L = cau_context->key_3_low;
        }

        if(CAU_MODE_AES_ECB != algm_reg) {
            /* restore the initialization vectors */
            CAU_IV0H = cau_context->iv_0_high;
            CAU_IV0L = cau_context->iv_0_low;
            CAU_IV1H = cau_context->iv_1_high;
            CAU_IV1L = cau_context->iv_1_low;
        }

        /* if in GCM/CCM mode, restore the context switch registers */
        if((CAU_MODE_AES_GCM == algm_reg) || (CAU_MODE_AES_CCM == algm_reg)) {
            CAU_GCMCCMCTXSx(0U) = cau_context->gcmccmctxs[0U];
            CAU_GCMCCMCTXSx(1U) = cau_context->gcmccmctxs[1U];
            CAU_GCMCCMCTXSx(2U) = cau_context->gcmccmctxs[2U];
            CAU_GCMCCMCTXSx(3U) = cau_context->gcmccmctxs[3U];
            CAU_GCMCCMCTXSx(4U) = cau_context->gcmccmctxs[4U];
            CAU_GCMCCMCTXSx(5U) = cau_context->gcmccmctxs[5U];
            CAU_GCMCCMCTXSx(6U) = cau_context->gcmccmctxs[6U];
            CAU_GCMCCMCTXSx(7U) = cau_context->gcmccmctxs[7U];
        }

        /* if in GCM mode, restore the context switch registers */
        if(CAU_MODE_AES_GCM == algm_reg) {
            CAU_GCMCTXSx(0U) = cau_context->gcmctxs[0U];
            CAU_GCMCTXSx(1U) = cau_context->gcmctxs[1U];
            CAU_GCMCTXSx(2U) = cau_context->gcmctxs[2U];
            CAU_GCMCTXSx(3U) = cau_context->gcmctxs[3U];
            CAU_GCMCTXSx(4U) = cau_context->gcmctxs[4U];
            CAU_GCMCTXSx(5U) = cau_context->gcmctxs[5U];
            CAU_GCMCTXSx(6U) = cau_context->gcmctxs[6U];
            CAU_GCMCTXSx(7U) = cau_context->gcmctxs[7U];
        }

        /* if in CMAC mode, restore the context switch registers */
        if(CAU_MODE_AES_CMAC == algm_reg) {
            CAU_CMACCTXx(0U) = cau_context->cmacctxs[0U];
            CAU_CMACCTXx(1U) = cau_context->cmacctxs[1U];
            CAU_CMACCTXx(2U) = cau_context->cmacctxs[2U];
            CAU_CMACCTXx(3U) = cau_context->cmacctxs[3U];
        }

