RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_cau.c
        /* if it is AES ECB/CBC decryption, then first prepare key */
        aes_decrypt = CAU_CTL & (CAU_CTL_ALGM | CAU_CTL_CAUDIR);
        if(((CAU_MODE_AES_ECB | CAU_DECRYPT) == aes_decrypt) || ((CAU_MODE_AES_CBC | CAU_DECRYPT) == aes_decrypt)) {
            uint32_t alg_dir, algo_mode, swapping, keysel;

            /* flush IN/OUT FIFOs */
            cau_fifo_flush();
            /* parameters for key preparation for AES decryption */
            alg_dir = CAU_DECRYPT;
            algo_mode = CAU_MODE_AES_KEY;
            swapping = CAU_SWAPPING_32BIT;
            keysel = cau_context->ctl_config & CAU_CTL_KEYSEL;
            cau_init(alg_dir, algo_mode, swapping, keysel);

            /* enable CAU */
            cau_enable();

            /* wait until BUSY=0 */
            while(RESET != cau_flag_get(CAU_FLAG_BUSY)) {
            }

            /* parameters for decryption */
            CAU_CTL = cau_context->ctl_config;
        }

        /* enable CAU */
        cau_enable();
    }
}

/*!
    \brief      get the CAU flag status (API_ID(0x001DU))
    \param[in]  flag: CAU flag status
                only one parameter can be selected which is shown as below:
      \arg        CAU_FLAG_INFIFO_EMPTY: input FIFO empty
      \arg        CAU_FLAG_INFIFO_NO_FULL: input FIFO is not full
      \arg        CAU_FLAG_OUTFIFO_NO_EMPTY: output FIFO not empty
      \arg        CAU_FLAG_OUTFIFO_FULL: output FIFO is full
      \arg        CAU_FLAG_BUSY: the CAU core is busy
      \arg        CAU_FLAG_INFIFO: input FIFO flag status
      \arg        CAU_FLAG_OUTFIFO: output FIFO flag status
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus cau_flag_get(uint32_t flag)
{
    uint32_t reg = 0U;
    FlagStatus ret_flag = RESET;

    /* check if the flag is in CAU_STAT1 register */
    if(RESET != (flag & STAT_REG_MASK)) {
        reg = CAU_STAT1;
    } else {
        /* the flag is in CAU_STAT0 register */
        reg = CAU_STAT0;
    }

    /* check the status of the specified CAU flag */
    if(RESET != (reg & (flag & FLAG_MASK))) {
        ret_flag = SET;
    }

    return ret_flag;
}

/*!
    \brief      enable the CAU interrupts (API_ID(0x001EU))
    \param[in]  interrupt: specify the CAU interrupt source to be enabled
                one or more parameters can be selected which are shown as below:
      \arg        CAU_INT_INFIFO: input FIFO interrupt
      \arg        CAU_INT_OUTFIFO: output FIFO interrupt
    \param[out] none
    \retval     none
*/
void cau_interrupt_enable(uint32_t interrupt)
{
    /* enable the selected CAU interrupt */
    CAU_INTEN |= (interrupt & INT_FLAG_MASK);
}

/*!
    \brief      disable the CAU interrupts (API_ID(0x001FU))
    \param[in]  interrupt: specify the CAU interrupt source to be disabled
                one or more parameters can be selected which are shown as below:
      \arg        CAU_INT_INFIFO: input FIFO interrupt
      \arg        CAU_INT_OUTFIFO: output FIFO interrupt
    \param[out] none
    \retval     none
*/
void cau_interrupt_disable(uint32_t interrupt)
{
    /* disable the selected CAU interrupt */
    CAU_INTEN &= ~((interrupt & INT_FLAG_MASK));
}

/*!
    \brief      get the interrupt flag (API_ID(0x0020U))
    \param[in]  interrupt: CAU interrupt flag
                only one parameter can be selected which is shown as below:
      \arg        CAU_INT_FLAG_INFIFO: input FIFO interrupt
      \arg        CAU_INT_FLAG_OUTFIFO: output FIFO interrupt
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus cau_interrupt_flag_get(uint32_t interrupt)
{
    FlagStatus flag = RESET;

    /* check the status of the specified CAU interrupt */
    if(RESET != (CAU_INTF & (interrupt & INT_FLAG_MASK))) {
        flag = SET;
    }

    return flag;
}
